# CannotOpenLinkedFileServerNotFound Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LinkFailures..::..CannotOpenLinkedFileServerNotFound Property
BuiltInFailures..::..LinkFailures Class See Also
---
Cannot open the linked model using Open and Unload because the plugin [name] cannot be accessed. Please check plugin [name], which has server Id [serverId]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotOpenLinkedFileServerNotFound { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotOpenLinkedFileServerNotFound As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotOpenLinkedFileServerNotFound {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LinkFailures Class
Autodesk.Revit.DB Namespace